In [28]:
import numpy as np
import pandas as pd
import datetime

import warnings
warnings.filterwarnings("ignore")

In [2]:
date = pd.read_csv('E:/Python Programs/orders.csv')
time = pd.read_csv('E:/Python Programs/messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with Dates

In [7]:
# Converting to datetime datatype

date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract Year

In [9]:
date['date_year'] = date['date'].dt.year

In [11]:
date.sample(5)

          date  product_id  city_id  orders  date_year
363 2019-01-09        6860       26       1       2019
300 2019-05-31        2981       26    1004       2019
657 2019-01-26        7025       14      56       2019
917 2019-01-25        1613       28       6       2019
133 2018-07-23        6564       18       3       2018

#### 2. Extract Month

In [12]:
date['date_month_no'] = date['date'].dt.month

In [13]:
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month_no
432 2019-11-18        3098       28       6       2019             11
442 2019-06-04         963       13       1       2019              6
953 2018-11-24        1848       14     120       2018             11
234 2019-04-21        5200       28      19       2019              4
393 2019-05-19        2271        3      28       2019              5

#### 2. Extract Month Name instead of Month Number

In [14]:
date['date_month_name'] = date['date'].dt.month_name()

In [15]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
891,2018-11-18,3904,1,9,2018,11,November
928,2019-01-02,5371,22,4,2019,1,January
633,2018-12-26,4601,26,2,2018,12,December
940,2019-03-02,7208,6,1,2019,3,March
458,2019-08-02,5742,26,1,2019,8,August

#### 3. Extract Days

In [16]:
date['date_day'] = date['date'].dt.day

In [17]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
429,2019-11-11,2746,22,6,2019,11,November,11
235,2018-10-05,1288,20,22,2018,10,October,5
841,2019-11-17,5250,3,13,2019,11,November,17
712,2019-02-10,5290,3,8,2019,2,February,10
300,2019-05-31,2981,26,1004,2019,5,May,31

#### 4. Extract Day of Week

In [19]:
date['date_day_of_week'] = date['date'].dt.dayofweek

In [20]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_day_of_week
79,2019-05-17,420,26,1,2019,5,May,17,4
281,2019-06-17,4379,4,1,2019,6,June,17,0
335,2018-09-05,45,13,38,2018,9,September,5,2
361,2018-10-13,124,26,2,2018,10,October,13,5
816,2019-02-15,6634,25,5,2019,2,February,15,4

#### 5. Extract Day of Week Name

In [21]:
date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

#### Is Weekend or not?

In [22]:
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']), 1,0)

date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

#### Extract Quarter

In [26]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_dow_name,date_is_weekend,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

#### Extract Semester

In [27]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_dow_name,date_is_weekend,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#### Extract Time elapsed between Dates

In [29]:
today = datetime.datetime.today()

In [30]:
today

datetime.datetime(2024, 8, 7, 11, 45, 20, 920248)

In [31]:
today - date['date']

0     1702 days 11:45:20.920248
1     2184 days 11:45:20.920248
2     2115 days 11:45:20.920248
3     1817 days 11:45:20.920248
4     2040 days 11:45:20.920248
                 ...
995   2130 days 11:45:20.920248
996   2071 days 11:45:20.920248
997   1919 days 11:45:20.920248
998   1984 days 11:45:20.920248
999   1758 days 11:45:20.920248
Name: date, Length: 1000, dtype: timedelta64[ns]

In [32]:
(today - date['date']).dt.days

0      1702
1      2184
2      2115
3      1817
4      2040
       ...
995    2130
996    2071
997    1919
998    1984
999    1758
Name: date, Length: 1000, dtype: int64

#### Extract Weeks passed

In [38]:
# Allowed units are 'W', 'D', 'h', 'm', 's', 'ms', 'us', 'ns'

np.round((today - date['date']) / np.timedelta64(1, 'W'),0)

0      243.0
1      312.0
2      302.0
3      260.0
4      291.0
       ...
995    304.0
996    296.0
997    274.0
998    283.0
999    251.0
Name: date, Length: 1000, dtype: float64

## Working with Time

In [39]:
time.sample(5)

                    date                                                msg
142  2013-03-14 00:49:00                  Познакомлюсь с милой дамой лет 27
246  2015-11-11 00:50:00                    М+М .днепр. пиши 093 014 76  52
780  2012-11-29 01:52:00  Любить себя – это не эгоизм  это просто самая ...
756  2012-06-02 00:24:00         Девушки  вам тоже скучно?:-( 096 310 62 45
81   2013-09-23 00:53:00  ХОРОШИЙ ПАРЕНЬ ХОЧЕТ С ДЕВУШКОЙ 095 689 70 25 ...

In [41]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

#### Converting to datetime datatype

In [43]:
time['date'] = pd.to_datetime(time['date'])

In [44]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

#### Extracting Hour

In [46]:
time['hour'] = time['date'].dt.hour

In [47]:
time.sample(5)

,date,msg,hour
742,2014-04-13 22:55:00,П 37 ПОЗНАКОМЛЮСЬ С Д/Ж ДЛЯ ИНТ ОТНОШЕН.,22
50,2012-05-17 02:22:00,нормальный парень хочет познакомитса с хорошей...,2
36,2014-06-30 01:13:00,Адекватный парень с богатой фантазией пообщает...,1
862,2016-11-18 22:53:00,муж 45 днепр с дев для общ смс 066 625 21 85,22
722,2014-07-04 00:34:00,Позн с Дев для общения жел без тараканов мне 2...,0

#### Extracting Minutes

In [48]:
time['min'] = time['date'].dt.minute

In [49]:
time.sample(5)

,date,msg,hour,min
152,2014-11-02 00:27:00,Девушки кто скучает жду вгости Киев.Мне 27лет ...,0,27
669,2015-11-13 01:24:00,парни ждут в гости дев. г.днепр пишите смс 097...,1,24
99,2014-03-21 23:38:00,П37Позн с обыч простой не полной Д Ж СМС о себ...,23,38
690,2013-12-10 23:55:00,увезу Д до 20 за границу стойн красив Саша,23,55
96,2012-12-26 00:32:00,ПАР ПРИГЛАШУ ИЛИ ПРИЕДУ К ДЕВ ДЛЯ ВСТРЕЧИ. СЕЙ...,0,32

#### Extracting Seconds

In [50]:
time['sec'] = time['date'].dt.second

In [51]:
time.sample(5)

,date,msg,hour,min,sec
411,2015-09-03 23:27:00,девченки звоните мне 32 зовут РУСЛАМ. Буду рад...,23,27,0
179,2012-12-15 00:10:00,ИЩУ Ж/Д 30-45ЛЕТ.ДЛЯ ВСТРЕЧ.:)СНАЧАЛА СМС!КОСМ...,0,10,0
467,2014-07-07 01:21:00,Дима 30/182/82 ухожен интересен с чувством юмо...,1,21,0
85,2012-10-05 00:22:00,ПОЗНАКОМЛЮСЬ С СИМП ДЕВУШКОЙ Я СООТВЕТСТВУЮ.ОТ...,0,22,0
437,2015-12-16 23:05:00,Для с.о. с.с. познакомлюсь с д. ж. 35-40 лет 0...,23,5,0

#### Extracting only Time part from the Date

In [52]:
time['time'] = time['date'].dt.time

In [53]:
time.sample(5)

,date,msg,hour,min,sec,time
471,2016-05-20 23:31:00,М 45 познак. с жен. из Днепро-вска с/о Т.097-5...,23,31,0,23:31:00
217,2015-05-24 01:59:00,Привіт зва.Ігор097951 3825дівчата шукаю коханн...,1,59,0,01:59:00
202,2012-07-29 23:31:00,Витаха Дндз братанчик с дн,23,31,0,23:31:00
658,2014-09-23 01:05:00,Приятно когда рядом любимый человек... Но его...,1,5,0,01:05:00
729,2012-06-25 00:03:00,ПРИЕДУ К Д/Ж В ГОСТИ ИЛИ ПРИГЛАШУ К СЕБЕ СМС М...,0,3,0,00:03:00

#### Calculating Time Difference

In [54]:
today - time['date']

0     3888 days 10:55:20.920248
1     3752 days 12:05:20.920248
2     4238 days 11:24:20.920248
3     3540 days 11:14:20.920248
4     3937 days 12:34:20.920248
                 ...
995   4527 days 10:55:20.920248
996   3848 days 12:31:20.920248
997   4313 days 12:08:20.920248
998   4429 days 12:11:20.920248
999   3701 days 12:20:20.920248
Name: date, Length: 1000, dtype: timedelta64[ns]

#### Calculating Time Difference in Seconds

In [55]:
(today - time['date'])/np.timedelta64(1,'s')

0      3.359625e+08
1      3.242163e+08
2      3.662043e+08
3      3.058965e+08
4      3.402021e+08
           ...
995    3.911721e+08
996    3.325123e+08
997    3.726869e+08
998    3.827095e+08
999    3.198108e+08
Name: date, Length: 1000, dtype: float64

#### Calculating Time Difference in Minutes

In [56]:
(today - time['date'])/np.timedelta64(1,'m')

0      5.599375e+06
1      5.403605e+06
2      6.103404e+06
3      5.098274e+06
4      5.670034e+06
           ...
995    6.519535e+06
996    5.541871e+06
997    6.211448e+06
998    6.378491e+06
999    5.330180e+06
Name: date, Length: 1000, dtype: float64

#### Calculating Time Difference in Hours

In [57]:
(today - time['date'])/np.timedelta64(1,'h')

0       93322.922478
1       90060.089145
2      101723.405811
3       84971.239145
4       94500.572478
           ...
995    108658.922478
996     92364.522478
997    103524.139145
998    106308.189145
999     88836.339145
Name: date, Length: 1000, dtype: float64